Этап 1: Регистрация в GIT
Этап 2: Установить GIT(установить дополнительные пакеты)
Этап 3: Настройка VSCode(открыть Setting и вбить Git Enable-для того, чтобы проверить отмечена ли галочка в ней)
Этап 4: Создать репозиторий
Этап 5: Настройка VSCode(Перейти слева-панель и открыть иконку 'ветка' и нажать на кнопку авторизоваться)
Этап 6: Настройка VSCode(Oткрыть View сверху в панели и выбрать Command Pallete, ввести туда Add Remote.Перейти в  GitHub в свой репозиторий Code и скопировать путь в репозиторий и вставить в Add Remote from GitHub, а если авторизован, то можно выбрать из выпадающего и предлагающего, которые уже есть в наличии адреса в репозитории)

PS:Справа в панельке в правом углу есть 3 точки, открыв ее View мы переходим в Sourse Control, где мы можем выбирать наши репозитории и также можем там же выбирать 'создать новую ветку' и создавать 'commit'

Этап 7: Выгрузка данных(Когда мы хотим выгрузить данные нам необходимо написать комментарии-commit.Затем в панельке слева где 3 точки выбрать 'Push'или внизу слева появляется иконка 'облачко' которая тоже выполняет такую же функцию как push и также знаки 'цифра и стрелка вверх' и также 'стрелка из круга'которые дают информацию о том что в ожидании отправки и далее открывается всплывающее окно где надо нажать'yes' которая добавляет комментарии)